-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/sweeneri/Projects/Pipelines/DraftFiles/build/logs/create_sam
> ple.txt
  log type:  text
 opened on:  13 Nov 2017, 08:05:08

. set linesize 255

. 
. 
. *This section combines the history files togther into single dataset (they are currently stored in 5)
. * it also generates a randomid AT THE PROPERTY LEVEL for subsetting
. ** dropping equity loans and refis. 
. ** Could potentially drop based on other criteria here to save space
. 
. clear

. gen hgroup = 0

. save "$ddir/temp/apdat", replace
(note: dataset contains 0 observations)
file /home/sweeneri/Projects/Pipelines/DraftFiles/temp/apdat.dta saved

. 
. forval i = 1/5 {
  2.         use $ddir/temp/CA_history_group`i' , clear
  3.         drop if bad_history_t == . /*missing means equity loans or refis */
  4.         gen hgroup = `i'
  5.         append using $ddir/temp/apdat, force
  6.         save $ddir/temp/apdat, replace
  7.         
. }
(3,045,992 observations deleted)
file /home/sweeneri/Projects/Pipelines/DraftFiles/temp/apdat.dta saved
(9,268,382 observations deleted)
(note: variable sr_buyer_3 was str35, now str39 to accommodate using data's values)
(label dup_flag already defined)
(label trantype already defined)
(label quitclaim already defined)
(label armslength already defined)
(label fullpart already defined)
(label multapn already defined)
(label multport already defined)
(label lenderseller already defined)
(label loantype already defined)
(label distress already defined)
(label corporation already defined)
file /home/sweeneri/Projects/Pipelines/DraftFiles/temp/apdat.dta saved
(9,586,000 observations deleted)
(note: variable mm_fips_muni_code was byte, now int to accommodate using data's values)
(note: variable mm_fips_county_name was str14, now str15 to accommodate using data's values)
(note: variable sr_buyer_2 was str42, now str45 to accommodate using data's values)
(note: variable sr_seller_2 was str38, now str45 to accommodate using data's values)
(note: variable sr_buyer_3 was str35, now str39 to accommodate using data's values)
(label dup_flag already defined)
(label trantype already defined)
(label quitclaim already defined)
(label armslength already defined)
(label fullpart already defined)
(label multapn already defined)
(label multport already defined)
(label lenderseller already defined)
(label loantype already defined)
(label distress already defined)
(label corporation already defined)
file /home/sweeneri/Projects/Pipelines/DraftFiles/temp/apdat.dta saved
(7,826,046 observations deleted)
(note: variable mm_fips_muni_code was byte, now int to accommodate using data's values)
(note: variable mm_fips_county_name was str11, now str15 to accommodate using data's values)
(note: variable sr_parcel_nbr_raw was str19, now str40 to accommodate using data's values)
(note: variable sr_buyer was str47, now str49 to accommodate using data's values)
(note: variable sr_lndr_last_name_1 was str20, now str25 to accommodate using data's values)
(note: variable sr_lndr_first_name_2 was str30, now str38 to accommodate using data's values)
(note: variable sr_lndr_last_name_2 was str18, now str24 to accommodate using data's values)
(note: variable sr_buyer_2 was str36, now str45 to accommodate using data's values)
(note: variable sr_seller_2 was str35, now str45 to accommodate using data's values)
(note: variable sr_lndr_last_name_3 was str14, now str17 to accommodate using data's values)
(note: variable sr_buyer_3 was str33, now str39 to accommodate using data's values)
(note: variable sr_seller_3 was str33, now str35 to accommodate using data's values)
(note: variable sr_buyer_1m was str33, now str39 to accommodate using data's values)
(note: variable sr_seller_1m was str25, now str30 to accommodate using data's values)
(label corporation already defined)
(label dup_flag already defined)
(label trantype already defined)
(label quitclaim already defined)
(label armslength already defined)
(label fullpart already defined)
(label multapn already defined)
(label multport already defined)
(label lenderseller already defined)
(label loantype already defined)
(label distress already defined)
file /home/sweeneri/Projects/Pipelines/DraftFiles/temp/apdat.dta saved
(3,032,543 observations deleted)
(note: variable mm_fips_muni_code was byte, now int to accommodate using data's values)
(note: variable mm_fips_county_name was str9, now str15 to accommodate using data's values)
(note: variable sr_buyer was str47, now str49 to accommodate using data's values)
(note: variable sr_seller was str42, now str50 to accommodate using data's values)
(note: variable sr_lndr_last_name_1 was str19, now str25 to accommodate using data's values)
(note: variable sr_lndr_first_name_2 was str30, now str38 to accommodate using data's values)
(note: variable sr_lndr_last_name_2 was str17, now str24 to accommodate using data's values)
(note: variable sr_buyer_2 was str39, now str45 to accommodate using data's values)
(note: variable sr_seller_2 was str36, now str45 to accommodate using data's values)
(note: variable sr_lndr_last_name_3 was str12, now str17 to accommodate using data's values)
(note: variable sr_buyer_3 was str30, now str39 to accommodate using data's values)
(note: variable sr_seller_3 was str33, now str35 to accommodate using data's values)
(label corporation already defined)
(label dup_flag already defined)
(label trantype already defined)
(label quitclaim already defined)
(label armslength already defined)
(label fullpart already defined)
(label multapn already defined)
(label multport already defined)
(label lenderseller already defined)
(label loantype already defined)
(label distress already defined)
file /home/sweeneri/Projects/Pipelines/DraftFiles/temp/apdat.dta saved

. save "$ddir/temp/apdat", replace
file /home/sweeneri/Projects/Pipelines/DraftFiles/temp/apdat.dta saved

. 
. 
. use "$ddir/temp/apdat", clear

. sort sr_property_id

. gen random_id = runiform()

. bys sr_property: replace random_id = . if _n > 1
(22464825 real changes made, 22464825 to missing)

. replace random_id = random_id[_n-1] if random_id == .
(22,464,825 real changes made)

. save $ddir/generated_data/CA_hist_all, replace
file /home/sweeneri/Projects/Pipelines/DraftFiles/generated_data/CA_hist_all.dta saved

. 
. 
. 
. ***MERGE WITH OTHER DATA
. use $bdir/output/CA_assess_to_sanbruno.dta, clear

. merge 1:1 sr_property_id using $bdir/output/CA_assess_to_PGE.dta, nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        12,529,884  
    -----------------------------------------

. merge 1:1 sr_property_id using $bdir/output/CA_assess_to_pipes_nodistr.dta, nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        12,529,884  
    -----------------------------------------

. merge 1:1 sr_property_id using $bdir/output/CA_assess_to_pipes_nodistr_pge.dta, nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        12,529,884  
    -----------------------------------------

. merge 1:1 sr_property_id using $bdir/output/CA_assess_to_highways.dta, nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        12,529,884  
    -----------------------------------------

. merge 1:1 sr_property_id using $bdir/output/CA_assess_to_pipes.dta, nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        12,529,884  
    -----------------------------------------

. merge 1:1 sr_property_id using $bdir/output/CA_assess_to_top100_lines.dta, nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        12,529,884  
    -----------------------------------------

. merge 1:1 sr_property_id using $bdir/output/CA_assess_to_top100_pts.dta, nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        12,529,884  
    -----------------------------------------

. 
. keep sr_property_id km_* x_ctm y_ctm

. save sbdata, replace
file sbdata.dta saved

. 
. *2010 tract ids
. use $bdir/output/CA_assess_to_2010tracts.dta, clear

. destring GEOID10, gen(areakey)
GEOID10: all characters numeric; areakey generated as double

. format areakey %11.0f

. drop GEOID10

. tostring areakey, gen(GEOID10) format(%11.0f)
GEOID10 generated as str10

. gen te = length(GEOID10)

. gen tract_id = substr(GEOID10,5,6)
(11,105 missing values generated)

. replace tract_id = substr(GEOID10,6,6) if te == 11
(0 real changes made)

. destring tract_id, replace
tract_id: all characters numeric; replaced as long
(11105 missing values generated)

. destring sr_property_id, replace
sr_property_id: all characters numeric; replaced as long

. keep sr_property_id tract_id GEOID10

. save geomap10, replace
file geomap10.dta saved

. 
. use if random_id < 1.01 using $ddir/generated_data/CA_hist_all, clear

. 
. ****** Here push the date back by 30 days to account for agreement vs signing date ******
. clonevar sr_date_transfer_DQorig = sr_date_transfer
(201 missing values generated)

. replace sr_date_transfer = sr_date_transfer - 30
(32,462,193 real changes made)

. label var sr_date_transfer "Recorded date of transfer, minus 30 days to approx. true agreement date"

. label var sr_date_transfer_DQorig "Original value of sr_date_transfer, as entered by DataQuick"

. 
. gen year = year(sr_date_transfer )
(201 missing values generated)

. gen month = month(sr_date_transfer )
(201 missing values generated)

. gen ym_sale = ym(year,month)
(201 missing values generated)

. format ym_sale %tm

. 
. * convert to real prices (2013 $)
. merge m:1 year month using $bdir/input/deflator, nogen keep(match master)

    Result                           # of obs.
    -----------------------------------------
    not matched                           201
        from master                       201  
        from using                          0  

    matched                        32,462,193  
    -----------------------------------------

. gen price = sr_val_transfer*deflator
(202 missing values generated)

. label var price "Transfer price (2013$)"

. 
. *merge in distances
. merge m:1 sr_property_id using sbdata, keep(match master) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             3
        from master                         3  
        from using                          0  

    matched                        32,462,391  
    -----------------------------------------

. 
. *merge in assessor data
. merge m:1 sr_property_id using $ddir/generated_data/CA_assess_all.dta, keep(match master) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             3
        from master                         3  
        from using                          0  

    matched                        32,462,391  
    -----------------------------------------

. 
. *first need to bring in 2010 geolytics tracts
. merge m:1 sr_property_id using geomap10, keep(match master) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             3
        from master                         3  
        from using                          0  

    matched                        32,462,391  
    -----------------------------------------

. replace tract_id = sa_census_tract if tract_id  == -99
(0 real changes made)

. rename mm_fips_muni_code county_id  

. 
. *CLEAN UP DATA 
. *keeping combined address and zip, and dropping parts 
. drop sa_site_house_nbr sa_site_fraction sa_site_dir sa_site_street_name sa_site_suf sa_site_post_dir ///
>  sa_site_unit_pre sa_site_unit_val tfile

. *dropping some property vars
. drop sa_township sa_section sa_val_assd_prev sa_nbr_bath_1qtr sa_nbr_bath_half sa_nbr_bath_3qtr sa_nbr_bath_full sa_nbr_bath_bsmt_half sa_nbr_bath_bsmt_full sa_privacy_code sa_roof_code sa_sqft_dq sa_val_transfer sa_doc_nbr_noval sa_date_transfer sa_dat
> e_noval_transfer inact_shell

. 
. *construct months since last transfer (any or arm's length)
. *these will be 30-day rounded months, not calendar months
. sort sr_property_id sr_date_transfer

. by sr_property_id: gen te = _n

. tsset sr_property_id te
       panel variable:  sr_property_id (unbalanced)
        time variable:  te, 1 to 35737
                delta:  1 unit

. gen mo_since_transfer_any = floor((sr_date_transfer - L.sr_date_transfer)/30)
(9,997,742 missing values generated)

. label var mo_since_transfer_any "Months since any transfer"

. gen tb = sr_date_transfer if transfer ==0
(18,573,247 missing values generated)

. replace tb = L.tb if tb == .
(9,056,295 real changes made)

. gen mo_since_transfer_al = floor((sr_date_transfer - L.tb)/30)
(16,577,549 missing values generated)

. order mo_* tb sr_property_id sr_date_transfer ym_sale sr_arms_length_flag sr_quitclaim

. label var  mo_since_transfer_al "Months since arm's length transfer"

. drop tb te

. gen age = year_transfer - sa_yr_blt
(4,917,628 missing values generated)

. label var age "Years since built" 

. 
. *CREATE SAMPLE
. /*Notes
> Selecting valid observations:
> - keep if bad history == 0 (1 means problem with transaction, missing means not an armslength sale)
> - assessor files only exist for most recent assessment (check this)
> - there is a bad assessor flag which cuts sample significantly
> ---- don't necessarily need to use this if we do property fe's
> - not doing anything with dup_flag right now */
. gen valid_sale = 1

. replace valid_sale = 0 if transfer == 1 // (from adam "transfer is equal to one if the transaction appears to be a non-arms-length transfer")
(18,573,165 real changes made)

. replace valid_sale = 0 if use_code_std > 4 // drop mobile homes and missing residential types, non residential
(1,322,083 real changes made)

. replace valid_sale = 0 if bad_history_transaction != 0 // (1 means problem with transaction, missing means not an armslength sale)
(2,524,921 real changes made)

. replace valid_sale = 0 if sa_x_coord == 0
(356 real changes made)

. replace valid_sale = 0 if dup_flag != 0 & dup_flag != 1 // 0 for non-duplicates
(358,888 real changes made)

. 
. *could drop properties with many sales
. capture drop te

. gen te = cond(transfer == 0,1,0)

. egen total_trans = sum(te), by(sr_property_id)

. replace te = . if dup_flag != 0 // 0 for non-duplicates
(3,928,360 real changes made, 3,928,360 to missing)

. egen total_trans_nd = sum(te), by(sr_property_id)

. drop te

. 
. egen tract_bg = group(county_id tract_id sa_census_block_group)
(4074 missing values generated)

. egen census_tract = group(county_id tract_id)
(4074 missing values generated)

. 
. save $ddir/generated_data/CA_sample, replace
file /home/sweeneri/Projects/Pipelines/DraftFiles/generated_data/CA_sample.dta saved

. 
. capture log close
